# یک برنامه بنویسید که اعداد سه رقمی را بگیرد و ارقام انها را جدا جدا چاپ کند

y = int(input("enter number:\t"))

#  temp = y % 10/////از سمت راست آخرین عدد رابرای من نمایش میدهد یعنی 123را برای من عدد 3 را نمایش می دهد

temp = y % 10
print(temp)
#  y = y//10از سمت راست آخرین عدد رابرای کم میکند  یعنی 123را برای من عدد 3حذف میکند وخروجی کار من 12را نمایش میدهد
y = y // 10
#  temp = y % 10/////از سمت راست آخرین عدد رابرای من نمایش میدهد یعنی 12را برای من عدد 2 را نمایش می دهد

temp = y % 10
print(temp)
#  y = y//10از سمت راست آخرین عدد رابرای کم میکند  یعنی 12را برای من عدد 2حذف میکند وخروجی کار من 1را نمایش میدهد

y = y // 10
#  temp = y % 10/////از سمت راست آخرین عدد رابرای من نمایش میدهد یعنی 1رابرای من  نمایش می دهد
temp = y % 10
print(y)
